Revit 2024 API
CurveElementFilter Properties
The CurveElementFilter type exposes the following members.
Properties
Name | Description
CurveElementType
 The curve element type.
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
CurveElementFilter Class
Autodesk.Revit.DB Namespace